Meta:

Narrative:
As a user
I want to perform an action
So that I can achieve a business goal

Scenario: Tvsets Yandex.Market test

When открываем главную страницу Яндекс

When заходим в Яндекс.Маркет

When кликаем ссылку Электроника

When переход в расширенный поиск Телевизоры

When вводим цену тв в расширенном поиске

When отмечаем чекбоксы с брендами Tv

When кликаем кнопку применить
Then проверяем, что количество элементов на странице равно 12

When запоминаем ТВ первый найденный элемент

When вводим в строку поиска ТВ то, что запомнили

When берём найденный ТВ элемент и сравниваем два элемента на равенство